.text
.globl  ___umodsi3, ___udivhi3


___divsi3:
div:  clr  -(sp)        /; Тип операции - деление
  br  divmod

___modsi3:
mod:  mov  $1, -(sp)     /; Тип операции - остаток от деления
  br  divmod

___udivsi3:
udiv:  mov  $256, -(sp)  /; Тип операции - беззнаковое деление
  br  divmod

___umodsi3:
umod:  mov  $257, -(sp)  /; тип операции - беззнаковый остаток от деления

divmod:  mov  r2, -(sp)  /; Сохранить регистры
  mov  r3, -(sp)
  mov  r4, -(sp)
  mov  r5, -(sp)
  mov  $32, -(sp)   /; Счётчик сдвигов

  mov  16(sp), r1   /; R0:R1 - делимое
  mov  14(sp), r0
  bpl  1f           /; Делимое положительное
  tstb  11(sp)      /; Операция беззнаковая ?
  bne  2f           /; Да
  neg  r1           /; Изменить знак делимого
  adc  r0
  neg  r0
  incb  1(sp)       /; Признак изменения знака частного
  br  2f
1:  bne  2f         /; Старшая часть делимого не равна нулю
  tst  r1           /; Проверка младшей части делимого на ноль
  beq  9f           /; Равна нулю - результат ноль
2:  mov  20(sp), r3 /; R2:R3 - делитель
  mov  18(sp), r2
  bpl  3f          /; Делитель положительный
  tstb  11(sp)     /; Операция беззнаковая ?
  bne  4f          /; Да
  neg  r3          /; Изменить знак делителя
  adc  r2
  neg  r2
  incb  1(sp)      /; Признак изменения знака частного
  br  4f
3:  bne  4f        /; Старшая часть делителя не равна нулю
  tst  r3          /; Проверка младшей части делителя на ноль
  beq  9f          /; Равна нулю - деление на ноль, результат ноль
4:  clr  r4        /; Инициализация R4:R5 - текущий остаток
  clr  r5
5:  asl  r1        /; Цикл сдвига делимого и частного (по совместительству)
  rol  r0
  rol  r5          /; Вдвигается в остаток
  rol  r4
  cmp  r4, r2      /; Остаток у нас больше или равен делителю (старшая часть)
  blo  7f          /; Нет
  bne  6f          /; Да
  cmp  r5, r3      /; Остаток у нас больше или равен делителю (младшая часть)
  blo  7f          /; Нет
6:  sub  r3, r5    /; Вычесть из текущего остатка делимое
  sbc  r4
  sub  r2, r4
  inc  r1          /; Прибавить один к частному
7:  decb  (sp)     /; Уменьшить счётчик сдвигов
  bne  5b          /; Цикл не окончен
  tstb  10(sp)     /; Операция деления ?
  beq  8f          /; Да
  mov  r5, r1      /; Перенести остаток в R0:R1
  mov  r4, r0
  tstb  11(sp)     /; Операция беззнаковая ?
  bne  10f         /; Да
  tst  16(sp)      /; Надо менять знак остатка?
  bpl  10f         /; Нет
  neg  r1          /; Сменить знак остатка
  adc  r0
  neg  r0
  br  10f
8:  rorb  1(sp)    /; Надо менять знак частного?
  bcc  10f         /; Нет
  neg  r1          /; Изменить знак частного
  adc  r0
  neg  r0
  br  10f
9:  clr  r0        /; Результат ноль
  clr  r1
10:  tst  (sp)+    /; Убрать из стека счётчик
  mov  (sp)+, r5   /; Востановить регистры
  mov  (sp)+, r4
  mov  (sp)+, r3
  mov  (sp)+, r2
  tst  (sp)+       /; Убрать тип операции
  rts  pc


___udivhi3:
    mov   r2, -(sp)
    mov   r3, -(sp)
    
    mov   6(sp), r0
    mov   8(sp), r2
    beq   3f  

    clr   r1
    mov   $16, r3

1:  asl   r0
    rol   r1
    cmp   r1, r2
    blo   2f
    sub   r2, r1
    inc   r0
2:  sob   r3, 1b

    br    4f

3:  clr   r0              /; Деление на 0
4:  mov   (sp)+, r3
    mov   (sp)+, r2
    rts   pc



